In [6]:
import pandas as pd
import numpy as np

In [8]:
df = pd.DataFrame([[np.nan,2,np.nan,0],[3,4,np.nan,1],
                  [np.nan,np.nan,np.nan,5]], columns=list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

* ### ___결측치 삭제___

In [10]:
df.dropna(axis=1, how='any')
# axis = 0 :행(row)
# axis = 1 : 열(column)
# how = 'all' : 전부다 null값이면 드랍시킨다.
# how = 'any' : 하나라도 null값이 있으면 드랍시킨다.

   D
0  0
1  1
2  5

In [11]:
df.dropna(axis=0, how='all')

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

* ### ___결측치 채우기___

In [13]:
df.fillna(0)

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5

In [16]:
values = {'A':0,'B':1,'C':2,'D':3}
values

{'A': 0, 'B': 1, 'C': 2, 'D': 3}

In [18]:
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5

In [19]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [23]:
df.fillna(df['D'].mean())

     A    B    C  D
0  2.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  2.0  2.0  2.0  5

In [22]:
fill_na_value = df['D'].max()
fill_na_value

5

In [24]:
df.fillna(fill_na_value)

     A    B    C  D
0  5.0  2.0  5.0  0
1  3.0  4.0  5.0  1
2  5.0  5.0  5.0  5

* ### ___결측치인지 판단하기___

In [27]:
df.isnull()

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True   True  True  False

In [29]:
df.isnull().sum()

A    2
B    1
C    3
D    0
dtype: int64

In [30]:
df.notnull()

       A      B      C     D
0  False   True  False  True
1   True   True  False  True
2  False  False  False  True